#### StairsEndNotchOption Enumeration

---

|  |
| --- |
| See Also |

The style of notch width for the stairs.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsEndNotchOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsEndNotchOption ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsEndNotchOption ``` |

# Members

| Member name | Description |
| --- | --- |
| FullRunWidth | The notch width is the run width. |
| Custom | The notch width is customized by user. |

# See Also

Autodesk.Revit.DB.Architecture Namespace